IDENTIFICATION DIVISION.
PROGRAM-ID. HELLO-WORLD.

ENVIRONMENT DIVISION.
CONFIGURATION SECTION.
	SOURCE-COMPUTER. XXX-ZOS.
	OBJECT-COMPUTER. XXX-ZOS.
INPUT-OUTPUT SECTION.
	FILE-CONTROL.
	SELECT FILEN ASSIGN TO DDNAME
	ORGANIZATION IS SEQUENTIAL.

DATA DIVISION.
WORKING-STORAGE SECTION.
	01 WS-NAME 	PIC A(30).
	01 WS-ID	PIC 9(5) VALUE '1234'.

*> simple hello world program
PROCEDURE DIVISION.
	A000-FIRST-PARA.
	DISPLAY 'Hello World'.
	MOVE 'Adam Tomaja' TO WS-NAME.
	DISPLAY "My name is: "WS-NAME.
	DISPLAY "My ID is: "WS-ID.

STOP RUN.
